#include"SCI1.h"
#include"COM_Str.h"
#include"iodefine.h"

Comm_Str SEND_SCI1;					//SCI1　送信用構造体変数宣言
Comm_Str REC_SCI1;					//SCI1　受信用構造体変数宣言

Comm_ctrl_Str SEND_Ctrl_SCI1;				//SCI1　送信制御用構造体変数宣言
Comm_ctrl_Str REC_Ctrl_SCI1;				//SCI1　受信制御用構造体変数宣言

#define LF_code 0x0a					//ASCII　改行コード

/*--------------------------------------------------------------------------------------

初期化

---------------------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------------
	関数名		: firm_SCI1_ini_send_buf
	内容	 	: 送信バッファ初期化
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/
void firm_SCI1_init_send_buf(){
	
	memset(&SEND_SCI1.BUF, 0x00, sizeof(SEND_SCI1.BUF));	//memset(セットしたい変数のアドレス, セットしたい値, 変数のサイズ指定)
	
	SEND_SCI1.Buf_staddr = &SEND_SCI1.BUF.Data[0];		//送信用データの先頭アドレスを先頭アドレスポインタに格納
	SEND_SCI1.Count      = &SEND_SCI1.BUF.Data[0];		//送信用データの先頭アドレスをアドレスカウンターに格納　キューカウントポインタ
	
	SEND_Ctrl_SCI1.flag = 0;				//送信許可フラグ　禁止設定　1:許可　0:禁止
	set_send_strl_time_SCI1();				//送信感覚変数　初期化
}

/*-------------------------------------------------------------------------------
	関数名		: firm_SCI1_ini_rec_buf
	内容	 	: 送信バッファ初期化
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/
void firm_SCI1_init_rec_buf(){
	
	memset(&REC_SCI1.BUF, 0x00, sizeof(REC_SCI1.BUF));	//memset(セットしたい変数のアドレス, セットしたい値, 変数のサイズ指定);
	
	REC_SCI1.Buf_staddr = &REC_SCI1.BUF.Data[0];		//受信用データの先頭アドレスを先頭アドレスポインタに格納
	REC_SCI1.Count      = &REC_SCI1.BUF.Data[0];		//受信用データの先頭アドレスをアドレスカウンターに格納　キューカウントポインタ
	
	REC_Ctrl_SCI1.enter = 1;				//改行コード確認フラグを許可する
}

/*-------------------------------------------------------------------------------
	関数名		: set_send_strl_time_SCI1
	内容	 	: 送信バッファ初期化
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/
void set_send_strl_time_SCI1(){
	
	SEND_Ctrl_SCI1.res   = 0;					//送信予約フラグ off:0 on:1
	SEND_Ctrl_SCI1.enter = 1;					//CRC　確認済みフラグ　確認済み　1:確認済　0:未確認
	SEND_Ctrl_SCI1.CountDown_ms = SendCountDown;			//送信カウントダウン時間を残り時間に設定
}

/*--------------------------------------------------------------------------------------

送信データバッファの作成

---------------------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------------
	関数名		: set_SCI1_data
	内容	 	: 送信データバッファの作成
	引数		: unsigned char total   : 合計送信バイト数　引数で渡す時はsizepf演算を行った結果を渡す
			  unsigned char *data_p : 送信データ一部先頭アドレス
	戻値		: 無し
-------------------------------------------------------------------------------*/
void set_SCI1_data(volatile unsigned char total, unsigned char *data_p){
	
	if(total >= MaxDataBuf_val){return;}				   //合計送信バイト数が最大データバイト数よりも大きければ処理を行わない
	
	memset (&SEND_SCI1.BUF.Data[0], 0x00, sizeof(SEND_SCI1.BUF.Data)); //データ部のバッファのみをクリアする
	memcpy (&SEND_SCI1.BUF.Data[0], data_p, total);			   //memcpy(コピー先のアドレス, コピー元のアドレス, コピーバイト数)
	
	SEND_SCI1.BUF.Data[total - 1] = LF_code;			   //データ部の最終バイトに改行コードを格納
}

/*--------------------------------------------------------------------------------------

送信制御

---------------------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------------
	関数名		: SCI1_send_reserv_ON
	内容	 	: 送信許可
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/

void SCI1_send_reserv_ON(){

	SEND_Ctrl_SCI1.res = 1;						//送信予約フラグ　ON
}

/*-------------------------------------------------------------------------------
	関数名		: send_init_SCI1
	内容	 	: 送信割り込み許可レジスタ制御
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/

void send_init_SCI1(){
	
	if(SEND_Ctrl_SCI1.flag){ return; }				//動作許可管理用フラグが1であれば何も処理を行わない　0:未許可　1:許可
	
	SEND_Ctrl_SCI1.flag = 1;					//動作許可管理用フラグを許可に設定
	
	SCI1.SCR.BIT.TIE = 1;						//SCI1　送信割り込み許可　TXI割り込み要求通知を許可
	IR(SCI1, TXI1) = 1;						//SCI1のTXI1の割り込み設定　送信割り込み
}

/*-------------------------------------------------------------------------------
	関数名		: ctrl_send_SCI1
	内容	 	: 送信間隔制御
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/

void ctrl_send_SCI1(){
	
	if(SEND_Ctrl_SCI1.flag){ return; }				//動作許可管理用フラグが1であれば何も処理を行わない　0:未許可　1:許可
	
	SEND_Ctrl_SCI1.CountDown_ms--;					//動作許可中の残り時間をカウントダウンする
	
	if(!SEND_Ctrl_SCI1.CountDown_ms){				//残り時間が0になったら処理を行う
		set_send_strl_time_SCI1();				//残り時間再セット　詳細は初期化部分
	}
}

/*--------------------------------------------------------------------------------------

送信中割り込み

---------------------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------------
	関数名		: SCI1_TXI1
	内容	 	: 送信バッファエンプティ割り込み
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/

void SCI1_TXI1(){
	
	SCI1.TDR = *SEND_SCI1.Count;					//送信データレジスタに送信データアドレスのポインタ渡し
	
	if(*SEND_SCI1.Count == LF_code){				//送信データが改行コードの時に送信終了処理を行う
		
		SCI1.SCR.BIT.TIE = 0;					//送信割り込み　禁止
		SEND_SCI1.Count = SEND_SCI1.Buf_staddr;			//送信カウント　先頭アドレスで初期化
		SCI1.SCR.BIT.TEIE = 1;					//送信終了割り込みを許可
	}
	SEND_SCI1.Count++;						//送信データアドレスをインクリメント　1byteずらす
}

/*-------------------------------------------------------------------------------
	関数名		: SCI1_TEI1
	内容	 	: 送信終了割り込み
	引数		: 無し
	戻値		: 無し
-------------------------------------------------------------------------------*/
void SCI1_TEI1(){
	
	SCI1.SCR.BIT.TEIE = 0;						//送信終了割り込みを禁止
	SEND_Ctrl_SCI1.flag = 0;					//動作管理用フラグを0にする
}

