#include"iodefine.h"
#include"Timer.h"


/*-------------------------------------------------------------------------------
	関数名		: Call_CMT0
	内容	 	: CMT0 通信用 10us
	引数		: 無し
	戻値		: 無し
	更新日		: 2018/07/09
-------------------------------------------------------------------------------*/
void Call_CMT0(void){
	
	count_echopuls();
	//Range_Calcu();
	
	return;
}

/*-------------------------------------------------------------------------------
	関数名		: Call_CMT1
	内容	 	: CMT2 通信用 1ms
	引数		: 無し
	戻値		: 無し
	更新日		: 2017/11/16
-------------------------------------------------------------------------------*/
void Call_CMT1(void){
	
	return;

}

/*-------------------------------------------------------------------------------
	関数名		: Call_CMT2
	内容	 	: CMT2 定周期タイマー 1ms	(通信用)
	引数		: 無し
	戻値		: 無し
	更新日		: 2017/08/18
-------------------------------------------------------------------------------*/
void Call_CMT2(void){
	
	//ctl_send_SCI1();					//SCI1送信タイミング制御関数
	
	return;

}


/*-------------------------------------------------------------------------------
	関数名		: Call_CMT3
	内容	 	: CMT3 定周期タイマー 1ms
	引数		: 無し
	戻値		: 無し
	更新日		: 2017/08/18
-------------------------------------------------------------------------------*/
void Call_CMT3(void){
	

	return;

}



/*-------------------------------------------------------------------------------
	関数名		: delay_us
	内容	 	: ソフトウェアタイマー 1us
	引数		: unsigned int us
	戻値		: 無し
	更新日		: 2017/10/04
-------------------------------------------------------------------------------*/
void delay_us(volatile unsigned int set_timer){

unsigned int i, j;

	for (i = 0; i < set_timer; i++) {

		for (j = 0; j < 1; j++);
	
	}	
	
	return;

}

/*-------------------------------------------------------------------------------
	関数名		: delay_ms
	内容	 	: ソフトウェアタイマー 1ms
	引数		: unsigned int ms
	戻値		: 無し
	更新日		: 2017/10/04
-------------------------------------------------------------------------------*/
void delay_ms(volatile unsigned int set_timer){
	
unsigned int i, j;

	for (i = 0; i < set_timer; i++) {

		for (j = 0; j < 2500; j++);
	
	}
	
	return;
}

/*-------------------------------------------------------------------------------
	関数名		: delay_s
	内容	 	: ソフトウェアタイマー 1s
	引数		: unsigned int s
	戻値		: 無し
	更新日		: 2017/10/04
-------------------------------------------------------------------------------*/
void delay_s(volatile unsigned int set_timer){
	
unsigned int i, j;

	for (i = 0; i < set_timer; i++) {

		for (j = 0; j < 2500000; j++);
	
	}
	
	return;

}